Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServerProxy.CreateEngineeringGeolocation(Autodesk.Revit.DB.Geolocation.Services.EngineeringGeolocationData)
Create and fill in an EngineeringGeolocation based on the specified data.

Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServerProxy.CreateDerivedGeolocation(Autodesk.Revit.DB.Geolocation.Services.DerivedGeolocationData)
Create and fill in an AdvancedGeolocation based on the specified data.

Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServerProxy.CreateBasicGeolocation(Autodesk.Revit.DB.Geolocation.Services.BasicGeolocationData)
Create and fill in a BasicGeolocation based on the specified data.

Autodesk.Revit.DB.Geolocation.Services.ICreateGeolocationServerProxy.CreateAdvancedGeolocation(Autodesk.Revit.DB.Geolocation.Services.AdvancedGeolocationData)
Create and fill in an AdvancedGeolocation based on the specified data.